[
  {
    "date":"Dec. 1, 2025",
    "summary":"We have 2 papers accepted by IEEE VIS 2025, 5 papers accepted by UIST 2025 and 1 paper accepted by TVCG."
  },{
    "date":"Nov. 4, 2025",
    "summary":"Congratulations to Renzhong Li on winning the <span style=\"color:red\">Best Paper Award</span> at IEEE VIS 2025 for the paper <b>Causality-based Visual Analytics of Sentiment Contagion in Social Media Topics</b>!",
    "link": "/publications/CausalMap"
  },{
    "date": "June. 1, 2025",
    "summary": "Our paper <b>T3Set: A Multimodal Dataset with Targeted Suggestions for LLM-based Virtual Coach in Table Tennis Training</b> has been accepted by ACM KDD 2025. We have released the dataset and related code. (<url style=\"color:blue\" href=\"http://github/jima-cs/T3Set\">Dataset Link</url>)",
    "link": "http://github/jima-cs/T3Set"
  },{
    "date": "April. 29, 2025",
    "summary": "Our paper <b>TableCanoniser: Interactive Grammar-Powered Transformation of Messy, Non-Relational Tables to Canonical Tables</b> has been accepted by ACM CHI 2025 (<span style=\"color:red\">Honorable Mention Award</span>)",
    "link": "/publications/TableCanoniser"
  },{
  "date": "Jan. 17, 2025",
  "summary": "We have 5 papers accepted by ACM CHI 2025 and 1 paper accepted by TVCG"
  },{
    "date": "Aug. 7, 2024",
    "summary": "Our paper <b>AdversaFlow: Visual Red Teaming for Large Language Models with Multi-Level Adversarial Flow</b> has been accepted by IEEE VIS 2024 (<span style=\"color:red\">Honorable Mention Award</span>)",
    "link": "/publications/AdversaFlow"
  },{
    "date": "July. 15, 2024",
    "summary": "We have 5 papers accepted by IEEE VIS 2024. These papers will also appear in IEEE TVCG. "
  },{
    "date": "Jan. 28, 2024",
    "summary": "We have 2 papers accepted by IEEE PacificVis 2024. These two papers will also appear in IEEE TVCG. We have 3 papers accepted by ACM CHI 2024 and 1 paper accepted by IEEE VR."
  },{
    "date": "July 23, 2023",
    "summary": "We have 3 papers accepted by IEEE VIS 2023. These papers will also appear in IEEE TVCG."
  },
  {
    "date": "Oct. 14, 2022",
    "summary": "Our paper <b>OBTracker: Visual Analytics of Off-ball Movements in Basketball</b> has been accepted by IEEE VIS 2022 (TVCG Track, <span style=\"color:red\">Honorable Mention Award</span>)",
    "link": "/publications/OBTracker"
  },
  {
    "date": "Feb 27, 2022",
    "summary": "Our papers <b>VisImages: A Fine-Grained Expert-Annotated Visualization Dataset</b> and <b>Visualizing the Scripts of Data Wrangling with SOMNUS</b> have been accepted by TVCG 2022! Each paper is with an open-source project!",
    "link": "/publications/VisImages"
  }
]
